///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа в модели сервиса.Базовая функциональность БИП".
// ОбщийМодуль.ИнтернетПоддержкаПользователейВМоделиСервисаПовтИсп.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция КлючОбластиДанных(ЗначениеРазделителя) Экспорт
	
	РаботаВМоделиСервисаБИП.УстановитьРазделениеСеанса(Истина, ЗначениеРазделителя);
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получение константы по имени выполняется для обхода проверки синтаксиса
	// в конфигурация не рассчитанных на работу в модели сервиса.
	Результат = Константы["КлючОбластиДанных"].Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	РаботаВМоделиСервисаБИП.УстановитьРазделениеСеанса(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти