
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИспользоватьВерсионированиеСложносочинённыхОбъектов = Константы.ИспользоватьВерсионированиеСложносочинённыхОбъектов.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьВерсионированиеСложносочинённыхОбъектовПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаСервере();
	ОбновитьИнтерфейс();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьНастройкиНаСервере();
	ОбновитьИнтерфейс();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()

	УстановитьПривилегированныйРежим(Истина);	
	
	Константы.ИспользоватьВерсионированиеСложносочинённыхОбъектов.Установить(ИспользоватьВерсионированиеСложносочинённыхОбъектов);

КонецПроцедуры

#КонецОбласти
