
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Автор: Карло И.В., 22.04.2021
	// Описание: Запись версии сложносочинённого объекта. 		
	//
	ВерсионированиеСложносочинённыхОбъектов.ЗаписатьВерсиюОбъекта(ЭтотОбъект, ТекущийОбъект);
	//
	// ...И.В.		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Измерение1 КАК Измерение1,
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Измерение2 КАК Измерение2,
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Ресурс1 КАК Ресурс1,
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Ресурс2 КАК Ресурс2,
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Ресурс3 КАК Ресурс3
	                      |ИЗ
	                      |	РегистрСведений.РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования КАК РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования
	                      |ГДЕ
	                      |	РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.Измерение1 = &Измерение1");	
	Запрос.УстановитьПараметр("Измерение1", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.РегистрСведенийДляПроверкиСистемыСложносочиненногоВерсионирования.СоздатьНаборЗаписей();
	Для Каждого СтрокаТаблицы Из Таблица Цикл 
		НоваяЗапись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицы);
		НоваяЗапись.Измерение1 = Объект.Ссылка;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры
